app/Controllers/AdminController.php

    public function index()
    {
        $session = session();
        $userId = $session->get('user_id');
        $role = $session->get('role');

        if($role == 1 || $role == 2 || $userId == 2){


        $customerModel = new CustomerModel();
        $usersModel = new UserModel();
        $projectModel = new ProjectModel();
        $followupModel = new FollowupModel();

        $totalCustomers = $customerModel->countAllResults();
        $totalusers = $usersModel->where('role',2)->countAllResults();
        $totalprojects = $projectModel->countAllResults();
        $totalfollowups = $followupModel->where('user_id',2)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `customer`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 2
SELECT COUNT(*) AS `numrows`
FROM `project`
SELECT COUNT(*) AS `numrows`
FROM `followup`
WHERE `user_id` = 2

    public function fetchUserProfile()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $userId = session()->get('user_id');
        $userModel = new UserModel();
        $userInfoModel = new UserInfoModel();

        $user = $userModel->find($userId);
        $userInfo = $userInfoModel->where('user_id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
SELECT *
FROM `userinfo`
WHERE `user_id` = '5'
 LIMIT 1

    public function editProfile()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'User not logged in']);
        }

        $userModel = new UserModel();
        $userInfoModel = new UserInfoModel();

        $user = $userModel->find($userId);
        $userInfo = $userInfoModel->where('user_id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
SELECT *
FROM `userinfo`
WHERE `user_id` = '5'
 LIMIT 1

                $data['image'] = $newName;
            }

            $userInfoModel->update($userId, $data);
            $userModel->update($userId, [
                'email' => $this->request->getPost('email'),
            ]);
---
UPDATE `userinfo` SET `name` = 'nitassssssssssssss', `phone` = '9078563414', `address` = 'katargamSuart'
WHERE `userinfo`.`id` IN ('5')
UPDATE `users` SET `email` = 'komal.feblead@gmail.com'
WHERE `users`.`id` IN ('5')