app/Controllers/CustomerController.php

     public function getCustomers()
     {

         $model = new CustomerModel();

         $customers = $model->findAll();
---
SELECT *
FROM `customer`