app/Controllers/LoginController.php

    public function authenticate()
    {
        if ($this->request->isAJAX()) {
            $validation = \Config\Services::validation();

            $validation->setRules([
                'email' => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ]);

            if (!$validation->withRequest($this->request)->run()) {
                return $this->response->setJSON([
                    'status' => 'error',
                    'errors' => $validation->getErrors()
                ]);
            }

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->validateUser($email, $password);

            if ($user) {
                $userInfoModel = new UserInfoModel();
                $userInfo = $userInfoModel->where('user_id', $user['id'])->first();
---
SELECT *
FROM `userinfo`
WHERE `user_id` = '1'
 LIMIT 1