app/Controllers/ProjectController.php

    public function getProject()
    {
        $session = session();
         $user_id = $session->get('user_id');
        $role = $session->get('role');

        $model = new ProjectModel();
        if($role == 1){
            $project = $model->select('project.id, customer.first_name as customer_name, userinfo.name as user_name, project.start_date , project.end_date,project.project_name')
            ->join('customer', 'project.customer_id = customer.id')
            ->join('userinfo', 'project.user_id = userinfo.id')
            ->findAll();
---
SELECT `project`.`id`, `customer`.`first_name` as `customer_name`, `userinfo`.`name` as `user_name`, `project`.`start_date`, `project`.`end_date`, `project`.`project_name`
FROM `project`
JOIN `customer` ON `project`.`customer_id` = `customer`.`id`
JOIN `userinfo` ON `project`.`user_id` = `userinfo`.`id`