app/Models/UserModel.php

    public function validateUser($email, $password)
    {
        return $this->where('email', $email)
            ->where('password', md5($password))
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
 LIMIT 1